// Пользователь вводит 8 чисел. Поместите их в массив и распечатайте.

Console.WriteLine("Hello, World!");
