// Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.


Console.WriteLine("Hello, World!");
